"""Модуль вопросов."""
questions = [
    {
        "текст": (
                "В каком году русский ученый Константин Циолковский в своей работе "
                "«Исследование мировых пространств реактивными приборами» "
                "обосновал возможность "
                "полета человека в космос с помощью ракеты на жидком топливе? "
                ),
        "варианты": ["1887 год", "1903 год", "1917 год"],
        "ответ": "1903 год",
        "картинка": "1.jpg",
    },
    {
        "текст": (
                "Как называлась группа энтузиастов, "
                "организованная в Москве в 1931 году "
                "для разработки первых реактивных двигателей и ракет в СССР, "
                "в которой начинал свой путь Сергей Королев? "
                ),
        "варианты": [
            "ГИРД (Группа изучения реактивного движения)",
            "Газодинамическая лаборатория (ГДЛ)",
            "Конструкторское бюро «Энергия»",
            ],
        "ответ": "ГИРД (Группа изучения реактивного движения)",
        "картинка": "2.jpg",
    },
    {
        "текст": (
                "Запуск какого аппарата, "
                "состоявшийся 4 октября 1957 года, "
                "положил начало космической эре человечества? "
                ),
        "варианты": ["«Луна-1»", "«Спутник-1» (ПС-1)", "«Восток-1»"],
        "ответ": "«Спутник-1» (ПС-1)",
        "картинка": "4.jpg",
    },
    {
        "текст": (
                "Какие собаки успешно вернулись на Землю из космоса на корабле "
                "«Спутник-5» 19 августа 1960 года, доказав возможность "
                "безопасного возвращения живых существ из космического полета? "
                ),
        "варианты": ["Дезик и Цыган", "Белка и Стрелка", "Лайка и Звездочка"],
        "ответ": "Белка и Стрелка",
        "картинка": "5.jpg",
    },
    {
        "текст": (
                "Сколько минут длился первый в истории полет человека в космос "
                "Юрия Гагарина на корабле «Восток-1» 12 апреля 1961 года? "
                ),
        "варианты": ["68 минут", "108 минут", "240 минут"],
        "ответ": "108 минут",
        "картинка": "6.jpg",
    },
    {
        "текст": (
                "В 1963 году первая женщина в мире совершила космический "
                "полет на корабле "
                "«Восток-6». Ее имя:"
                ),
        "варианты": ["Светлана Савицкая", "Валентина Терешкова", "Елена Кондакова"],
        "ответ": "Валентина Терешкова",
        "картинка": "7.jpg",
    },
    {
        "текст": (
                "Кто из советских космонавтов 18 марта 1965 года первым в истории "
                "человечества вышел в открытый космос с корабля «Восход-2»? "
                ),
        "варианты": ["Алексей Леонов", "Павел Беляев", "Владимир Комаров"],
        "ответ": "Алексей Леонов",
        "картинка": "8.jpg",
    },
    {
        "текст": (
                "Какое событие, ставшее важным шагом к созданию орбитальных станций, "
                "впервые произошло в январе 1969 года с кораблями «Союз-4» и «Союз-5»? "
                ),
        "варианты": [
            "Облет Луны без посадки",
            "Стыковка двух пилотируемых кораблей",
            "Запуск солнечной обсерватории",
            ],
        "ответ": "Стыковка двух пилотируемых кораблей",
        "картинка": "9.jpg",
    },
    {
        "текст": (
                "Как называлась первая в мире долговременная орбитальная станция, "
                "запущенная СССР в 1971 году, "
                "которая открыла эру длительных космических экспедиций? "
                  ),
        "варианты": ["«Салют»", "«Мир»", "«Алмаз»"],
        "ответ": "«Салют»",
        "картинка": "11.jpg",
    },
    {
        "текст": (
                "Знаменитая советская (а затем российская) орбитальная станция «Мир» "
                "была затоплена в Тихом океане в 2001 году. "
                "Как долго она прослужила на орбите? "
                ),
        "варианты": ["5 лет", "15 лет", "25 лет"],
        "ответ": "15 лет",
        "картинка": "10.jpg",
    },
    {
        "текст": (
                "С запуска какого функционально-грузового блока российского "
                "производства началось строительство Международной космической станции "
                "(МКС) в 1998 году? "
                ),
        "варианты": ["«Звезда»", "«Заря»", "«Поиск»"],
        "ответ": "«Заря»",
        "картинка": "14.jpg",
    },
    {
        "текст": (
                "Кто из российских космонавтов является абсолютным рекордсменом по "
                "суммарному пребыванию в космосе (более 1111 суток за пять полетов)? "
                ),
        "варианты": ["Геннадий Падалка", "Сергей Крикалев", "Олег Кононенко"],
        "ответ": "Олег Кононенко",
        "картинка": "12.jpg",
    },
    {
        "текст": (
                "Как называется новое семейство российских ракет-носителей, "
                "разработанное для замены ракет "
                "«Протон» и использующее экологически чистое топливо? "
                ),
        "варианты": ["«Ангара»", "«Союз-5»", "«Энергия»"],
        "ответ": "«Ангара»",
        "картинка": "3.jpg",
    },
    {
        "текст": (
                "Как называлась российская автоматическая станция, "
                "запущенная в августе 2023 года для отработки мягкой посадки в "
                "районе Южного полюса Луны, которая, к сожалению, потерпела крушение? "
                ),
        "варианты": ["«Луна-24»", "«Луна-25»", "«Луна-Глоб»"],
        "ответ": "«Луна-25»",
        "картинка": "13.jpg",
    },
    {
        "текст": (
                "Какую новую российскую орбитальную станцию планируется создать "
                "взамен МКС, причем ее развертывание начнется в составе российского "
                "сегмента МКС с последующим отделением? "
                ),
        "варианты": ["МКС-2", "РОС (Российская орбитальная станция)", "«Заря-2»"],
        "ответ": "РОС (Российская орбитальная станция)",
        "картинка": "15.jpg",
    },
    {
        "текст": (
                "Запуск какого первого модуля (научно-энергетического) "
                "Российской орбитальной станции запланирован на конец 2027 года? "
                ),
        "варианты": [
            "Базового модуля",
            "Шлюзового модуля",
            "Научно-энергетического модуля (НЭМ)",
            ],
        "ответ": "Научно-энергетического модуля (НЭМ)",
        "картинка": "15.jpg",
    },
    {
        "текст": (
                "Кто из советских космонавтов установил рекорд самого длительного "
                "одиночного полета в 1960-х годах, "
                "проведя на корабле «Восток-5» около 5 суток? "
                ),
        "варианты": ["Герман Титов", "Валерий Быковский", "Андриян Николаев"],
        "ответ": "Валерий Быковский",
        "картинка": "17.jpg",
    },
    {
        "текст": (
                "Кто из советских космонавтов первым из женщин вышла в открытый "
                "космос 25 июля 1984 года, работая за бортом станции «Салют-7»? "
                ),
        "варианты": ["Валентина Терешкова", "Елена Серова", "Светлана Савицкая"],
        "ответ": "Светлана Савицкая",
        "картинка": "18.jpg",
    },
    {
        "текст": (
                "В каком году советская автоматическая станция впервые в мире "
                "достигла поверхности Луны (совершила жесткую посадку)? "
                ),
        "варианты": ["1957 год", "1959 год", "1961 год"],
        "ответ": "1959 год",
        "картинка": "14.jpg",
    },
    {
        "текст": (
                "С 2025 года в России начал работу новый национальный проект, "
                "напрямую посвященный космосу. Какая из целей входит в этот проект? "
                ),
        "варианты": [
                    "Создание Российской орбитальной станции (РОС) ",
                    "Полная отмена пилотируемых пусков ",
                    "Сворачивание программы по исследованию Луны ",
                    ],
        "ответ": "Создание Российской орбитальной станции (РОС)",
        "картинка": "15.jpg",
    },
]
